[
  {
    "Name": "Technical Controls",
    "Description": "Technical controls are implemented using systems and software. Examples include operating system configurations, firewalls, and antivirus tools."
  },
  {
    "Name": "Managerial Controls",
    "Description": "Managerial controls are administrative measures related to security design and implementation. They include security policies and standard operating procedures."
  },
  {
    "Name": "Operational Controls",
    "Description": "Operational controls are implemented by people instead of systems. Examples include security guards and awareness training programs."
  },
  {
    "Name": "Physical Controls",
    "Description": "Physical controls limit physical access to secure areas. Common examples include guard shacks, fences, locks, and badge readers."
  },
  {
    "Name": "Control Types",
    "Description": "There are six main control types: preventive, deterrent, detective, corrective, compensating, and directive."
  },
  {
    "Name": "Preventive Controls",
    "Description": "Preventive controls are designed to block unauthorized access and stop incidents before they occur."
  },
  {
    "Name": "Deterrent Controls",
    "Description": "Deterrent controls discourage intrusion attempts by increasing the perceived risk to attackers."
  },
  {
    "Name": "Corrective Controls",
    "Description": "Corrective controls are applied after an incident to fix or mitigate its impact using alternative measures."
  },
  {
    "Name": "Directive Controls",
    "Description": "Directive controls guide subjects toward compliance and proper security behavior."
  },
  {
    "Name": "CIA Triad",
    "Description": "The CIA Triad consists of confidentiality, integrity, and availability, which form the foundation of information security."
  },
  {
    "Name": "Confidentiality",
    "Description": "Confidentiality ensures that information is only accessible to authorized individuals. This is achieved through encryption, access controls, and multi-factor authentication."
  },
  {
    "Name": "Integrity",
    "Description": "Integrity ensures that data is stored, transmitted, and processed as intended without unauthorized alteration or corruption."
  },
  {
    "Name": "Examples of Integrity",
    "Description": "Hashing maps data of any length into fixed-length values, digital signatures verify data integrity, certificates verify identity, and non-repudiation provides proof of integrity."
  },
  {
    "Name": "Availability",
    "Description": "Availability ensures that information and systems are accessible to authorized users when needed."
  },
  {
    "Name": "Examples of Availability",
    "Description": "Availability is maintained through redundancy, fault tolerance, and patching systems to prevent downtime or vulnerabilities."
  },
  {
    "Name": "Non-Repudiation",
    "Description": "Non-repudiation ensures that an individual cannot deny their actions. It provides proof of integrity and origin through logging and digital signatures."
  },
  {
    "Name": "Proof of Integrity",
    "Description": "Proof of integrity verifies that data has not changed during storage or transmission."
  },
  {
    "Name": "Hash",
    "Description": "A hash is a cryptographic function that represents data as a fixed-length string. Any change in data produces a different hash, ensuring integrity verification."
  },
  {
    "Name": "Proof of Origin",
    "Description": "Proof of origin confirms that a message was not altered, verifies the sender's identity, and ensures the authenticity of a digital signature."
  },
  {
    "Name": "Examples of Proof of Origin",
    "Description": "A private key is used to sign data, and a public key is used to verify it, ensuring authenticity and integrity."
  },
  {
    "Name": "AAA Framework",
    "Description": "The AAA framework stands for identification, authentication, authorization, and accounting. It defines how users are verified and tracked within systems."
  },
  {
    "Name": "Identification",
    "Description": "Identification is the process of claiming an identity using a username or ID within a system."
  },
  {
    "Name": "Authentication",
    "Description": "Authentication verifies the claimed identity using factors such as passwords, biometrics, or tokens."
  },
  {
    "Name": "Authorization",
    "Description": "Authorization determines what resources or actions an authenticated user is allowed to access, often based on roles or permissions."
  },
  {
    "Name": "Accounting",
    "Description": "Accounting tracks and logs user activity, including login times, data usage, and logout details, to support auditing and accountability."
  },
  {
    "Name": "Authenticating People",
    "Description": "When authenticating people, users enter credentials that are validated through VPN or firewall devices against an AAA server. If approved, access is granted to internal systems."
  },
  {
    "Name": "Authenticating Systems",
    "Description": "System authentication uses digital certificates installed on devices to verify their identity."
  },
  {
    "Name": "Certificate Authentication",
    "Description": "Certificate authentication relies on certificates issued by a Certificate Authority (CA) to verify identity using public key infrastructure."
  },
  {
    "Name": "CA Process",
    "Description": "Organizations generate device certificates, sign them with their internal CA, and use the CA's digital signature to validate the certificate."
  },
  {
    "Name": "Authorization Models",
    "Description": "Authorization models define how access is granted. Common models include Role-Based Access Control (RBAC), Attribute-Based Access Control (ABAC), and others defined by organizational needs."
  },
  {
    "Name": "Abstraction",
    "Description": "Abstraction reduces complexity by creating a clear relationship between users and resources, streamlining administration and improving scalability."
  },
  {
    "Name": "Gap Analysis",
    "Description": "A gap analysis compares the current security posture to the desired state, identifying weaknesses and areas for improvement."
  },
  {
    "Name": "Baseline",
    "Description": "A baseline defines internal security goals or standards that can be used to evaluate systems, processes, and compliance with formal frameworks."
  },
  {
    "Name": "Compare and Contrast",
    "Description": "Comparing and contrasting systems helps evaluate existing security measures, identify weaknesses, and conduct detailed analysis."
  },
  {
    "Name": "Analysis and Report",
    "Description": "The analysis and reporting phase documents findings from the gap analysis and outlines steps needed to achieve desired security goals."
  },
  {
    "Name": "Zero Trust",
    "Description": "Zero Trust is a security model that assumes no device or user should be trusted by default. Every access request must be verified, regardless of location or network."
  },
  {
    "Name": "Planes of Operation",
    "Description": "Planes of operation divide a network into layers such as data, control, and management planes, each handling different network functions."
  },
  {
    "Name": "Data Plane",
    "Description": "The data plane handles packet forwarding, encryption, and NAT operations, managing the actual movement of data across the network."
  },
  {
    "Name": "Control Plane",
    "Description": "The control plane manages how data is handled. It defines routing, enforces rules, and determines how traffic is directed."
  },
  {
    "Name": "Adaptive Identity",
    "Description": "Adaptive identity systems dynamically adjust trust based on user behavior, context, and authentication patterns."
  },
  {
    "Name": "Threat Scope Reduction",
    "Description": "Threat scope reduction focuses on limiting potential attack surfaces by minimizing entry points and reducing exposure."
  },
  {
    "Name": "Policy Driven Access Control",
    "Description": "Policy-driven access combines predefined rules with identity and behavior analysis to manage and enforce access decisions."
  },
  {
    "Name": "Security Zones",
    "Description": "Security zones define boundaries between trusted and untrusted environments, such as internal and external networks."
  },
  {
    "Name": "Policy Enforcement Point",
    "Description": "The policy enforcement point is the component that allows, monitors, or denies connections based on security rules and user context."
  },
  {
    "Name": "Policy Decision Point",
    "Description": "The policy decision point evaluates each access request against defined rules and determines whether access should be granted or denied."
  },
  {
    "Name": "Policy Administrator",
    "Description": "The policy administrator communicates with enforcement points, issues credentials or tokens, and instructs systems to allow or block access."
  },
  {
    "Name": "Policy Engine",
    "Description": "The policy engine processes and evaluates all rules to make final access decisions within a Zero Trust framework."
  },
  {
    "Name": "Barricades and Bollards",
    "Description": "Barricades and bollards prevent unauthorized physical access by directing or blocking movement at entry points."
  },
  {
    "Name": "Access Control Vestibules",
    "Description": "Access control vestibules act as controlled entry spaces that limit simultaneous access and verify credentials before entry."
  },
  {
    "Name": "Fence",
    "Description": "Fences establish clear physical perimeters and restrict movement into secured zones."
  },
  {
    "Name": "CCTV",
    "Description": "Closed-circuit television systems provide video surveillance for monitoring and recording activity."
  },
  {
    "Name": "Guards and Access Badges",
    "Description": "Security guards and access badges verify identity, provide physical protection, and ensure compliance with access rules."
  },
  {
    "Name": "Honeypots",
    "Description": "Honeypots are decoy systems used to attract and analyze attackers without endangering real systems."
  },
  {
    "Name": "Honeynets",
    "Description": "Honeynets are networks of interconnected honeypots that simulate realistic environments for threat detection and research."
  },
  {
    "Name": "Honeyfiles",
    "Description": "Honeyfiles contain fake information and generate alerts when accessed, helping identify intruders."
  },
  {
    "Name": "Honeytokens",
    "Description": "Honeytokens include traceable fake data that, when used or stolen, reveal the location and method of a data breach."
  },
  {
    "Name": "Change Management",
    "Description": "Change management is a formal process that ensures changes to systems are planned, tested, documented, and approved to avoid downtime or confusion."
  },
  {
    "Name": "Change Management Process",
    "Description": "The process involves requesting, reviewing, approving, scheduling, testing, and documenting all changes to maintain consistency and reduce risk."
  },
  {
    "Name": "Ownership",
    "Description": "Ownership defines who is responsible for initiating and overseeing a change or control implementation."
  },
  {
    "Name": "Stakeholders",
    "Description": "Stakeholders are individuals or groups affected by a change or decision within the security process."
  },
  {
    "Name": "Impact Analysis",
    "Description": "Impact analysis assesses potential risks and consequences associated with a proposed change or the absence of one."
  },
  {
    "Name": "Sandbox",
    "Description": "A sandbox is an isolated test environment where systems or code changes can be evaluated safely without affecting production."
  },
  {
    "Name": "Backout Plan",
    "Description": "A backout plan defines how to revert systems to a previous state if a change causes problems, ensuring continuity and recovery."
  },
  {
    "Name": "Maintenance Window",
    "Description": "A maintenance window specifies the scheduled period during which updates or maintenance can occur with minimal impact on operations."
  },
  {
    "Name": "Standard Operating Procedure (SOP)",
    "Description": "A standard operating procedure ensures repeatability and consistency in performing changes or implementing controls."
  },
  {
    "Name": "Allow List",
    "Description": "An allow list permits only approved applications or processes to run within a system, providing a strong form of control."
  },
  {
    "Name": "Deny List",
    "Description": "A deny list blocks known malicious or unauthorized applications from execution, often implemented through antivirus software."
  },
  {
    "Name": "Downtime",
    "Description": "Downtime is planned system inactivity, usually scheduled during non-peak hours to minimize disruption and risk."
  },
  {
    "Name": "Legacy Applications",
    "Description": "Legacy applications are older programs no longer supported by vendors. These systems require isolation and specialized maintenance."
  },
  {
    "Name": "Documentation",
    "Description": "Documentation ensures that all changes, configurations, and processes are properly recorded for future reference and audits."
  },
  {
    "Name": "Version Control",
    "Description": "Version control tracks configuration and file changes, allowing rollbacks and audits. Common examples include router configurations and software updates."
  }
]
