[
  {
    "Name": "On-Premises Security Overview",
    "Description": "Security posture can be fully customized. Organization controls hardware, data, access, and policies. On-site IT staff handle uptime, patching, and incident response. Ideal for sensitive or regulated data environments."
  },
  {
    "Name": "Decentralized Security Model",
    "Description": "Multiple sites, platforms, clouds, and devices. Difficult to secure consistently; configurations may vary. Recommended to move toward centralized visibility and control."
  },
  {
    "Name": "Centralized Security Model",
    "Description": "Unified monitoring and policy enforcement. Correlated alerts and consolidated logging. Easier patching and configuration management. Risk: single point of failure—requires redundancy."
  },
  {
    "Name": "Virtual Machines",
    "Description": "Run multiple OS instances on shared hardware. Each VM is isolated. Increases efficiency but adds management overhead. Hypervisor security is critical."
  },
  {
    "Name": "Containerization",
    "Description": "Runs applications in isolated containers sharing the host OS kernel. Lightweight, portable, and faster than VMs. Applications remain isolated from each other."
  },
  {
    "Name": "Container Images",
    "Description": "Portable, reproducible software packages ensuring consistent environments across development and production. Enable scalability and easy deployment."
  },
  {
    "Name": "SCADA / ICS Systems",
    "Description": "Used in industrial, manufacturing, and utility environments. Often decades old—must be segmented from IT networks. Critical for energy and automation control."
  },
  {
    "Name": "RTOS (Real-Time Operating System)",
    "Description": "Executes tasks at precise intervals for avionics, medical, or automotive use. Prioritizes reliability over new features; limited built-in security."
  },
  {
    "Name": "Embedded Systems",
    "Description": "Hardware + software built for a specific purpose such as IoT, wearables, or medical devices. Usually difficult to update or patch securely."
  },
  {
    "Name": "High Availability (HA)",
    "Description": "Multiple systems work together to prevent downtime. Requires configuration, monitoring, and testing. Adds cost and complexity but increases uptime."
  },
  {
    "Name": "MTTR (Mean Time to Repair)",
    "Description": "Average time required to restore service after failure. Lower MTTR = faster recovery and better availability."
  },
  {
    "Name": "Network Device Placement",
    "Description": "Firewalls separate trusted and untrusted zones. Jump servers mediate admin access. Honeypots lure attackers for analysis."
  },
  {
    "Name": "Security Zones",
    "Description": "Logical network divisions—trusted, internal, DMZ, external—simplify firewall rules and access controls."
  },
  {
    "Name": "Attack Surface Reduction",
    "Description": "Minimize exposed services, ports, code, and privileges. Perform continuous auditing, hardening, and monitoring."
  },
  {
    "Name": "Connectivity Security",
    "Description": "Protect physical cabling and network ports. Use encryption such as IPsec, TLS, and VPN tunnels."
  },
  {
    "Name": "Fail-Open vs Fail-Closed",
    "Description": "Fail-Open: traffic continues if system fails—higher availability, lower security. Fail-Closed: traffic stops—higher security, lower availability."
  },
  {
    "Name": "Active Monitoring (Inline)",
    "Description": "Traffic flows through the security device for real-time blocking (e.g., IPS). Risk: device failure may interrupt traffic."
  },
  {
    "Name": "Passive Monitoring (Out-of-Band)",
    "Description": "Traffic is mirrored to tools like IDS. Detects but cannot block threats—adds visibility without disrupting flow."
  },
  {
    "Name": "Jump Servers",
    "Description": "Hardened gateways providing controlled administrative access to secure internal networks. If compromised, impact is severe."
  },
  {
    "Name": "Proxy Servers",
    "Description": "Intermediate systems that provide caching, filtering, and inspection. Forward proxies control outbound user access; reverse proxies protect internal servers."
  },
  {
    "Name": "Open Proxies",
    "Description": "Public proxies with no authentication or control—significant security risk allowing anonymous misuse."
  },
  {
    "Name": "Load Balancing (Active/Active)",
    "Description": "Distributes traffic across multiple active servers for better performance and redundancy."
  },
  {
    "Name": "Load Balancing (Active/Passive)",
    "Description": "Secondary server remains idle until primary fails. Easier to implement but less resource-efficient."
  },
  {
    "Name": "Logging and Monitoring Tools",
    "Description": "Sensors collect firewall, server, and auth logs. Collectors (SIEM/syslog) aggregate and correlate data for threat detection."
  },
  {
    "Name": "Port Security and Network Access Control (NAC)",
    "Description": "802.1X + EAP require device authentication before access. Uses RADIUS, LDAP, TACACS+, or Kerberos. Client = Supplicant; Switch/AP = Authenticator; Server = Auth Authority."
  },
  {
    "Name": "Traditional Firewall / UTM",
    "Description": "Filters traffic by port, protocol, and IP. May include VPN, spam filtering, IDS/IPS, and bandwidth control."
  },
  {
    "Name": "Next-Gen Firewall (NGFW)",
    "Description": "Performs deep packet inspection to identify apps and content. Filters based on behavior, not just ports."
  },
  {
    "Name": "WAF (Web Application Firewall)",
    "Description": "Protects web apps from SQLi, XSS, and HTTP(S) exploits. Common in PCI DSS compliance environments."
  },
  {
    "Name": "VPN Technologies",
    "Description": "Encrypt data across public networks. VPN concentrators handle authentication and encryption."
  },
  {
    "Name": "SSL/TLS VPN",
    "Description": "Users connect via browser or lightweight client over TCP 443, which bypasses most firewall restrictions."
  },
  {
    "Name": "Site-to-Site IPsec VPN",
    "Description": "Always-on secure tunnel between networks for continuous encrypted connectivity."
  },
  {
    "Name": "SD-WAN and SASE",
    "Description": "SD-WAN routes cloud traffic efficiently. SASE provides cloud-based security edge for remote users."
  },
  {
    "Name": "Data Types",
    "Description": "Includes proprietary data, PII, PHI, and legal/financial records. Must be protected according to classification and regulation."
  },
  {
    "Name": "Data Classification Levels",
    "Description": "Public, Sensitive/Internal, Private/Confidential, and Critical. Determines handling and protection requirements."
  },
  {
    "Name": "Data States",
    "Description": "Data at Rest → encrypt + access control. Data in Transit → protect with TLS/IPsec. Data in Use → vulnerable in memory—use hardware protections."
  },
  {
    "Name": "Data Sovereignty",
    "Description": "Data is governed by laws of its storage region (e.g., GDPR). Organizations must respect local compliance requirements."
  },
  {
    "Name": "Data Protection Techniques",
    "Description": "Encryption, hashing, obfuscation, masking, tokenization, segmentation, and access permissions ensure confidentiality and integrity."
  },
  {
    "Name": "High Availability and Business Continuity",
    "Description": "Server clustering, load balancing, and site resiliency keep operations running during failures."
  },
  {
    "Name": "Backup Strategies",
    "Description": "Use on-site/off-site backups, snapshots, replication, and journaling for data recovery."
  },
  {
    "Name": "Disaster Recovery Testing",
    "Description": "Conduct tabletop exercises, simulations, and failover tests to validate plans and reduce MTTR."
  },
  {
    "Name": "Power Resilience",
    "Description": "UPS provides short-term backup; generators ensure long-term continuity during outages."
  }
]
