[
  {
    "Name": "Technical Controls",
    "Description": "Implemented using technology or systems. Examples: firewalls, antivirus, intrusion detection, access controls."
  },
  {
    "Name": "Managerial Controls",
    "Description": "Administrative measures that define security design and policy. Examples: security policies, risk assessments, standard operating procedures."
  },
  {
    "Name": "Operational Controls",
    "Description": "Implemented and executed by people. Examples: security awareness training, incident response procedures, background checks."
  },
  {
    "Name": "Physical Controls",
    "Description": "Restrict physical access to systems and facilities. Examples: fences, locks, badge readers, guard stations."
  },
  {
    "Name": "Control Types",
    "Description": "Preventive, Deterrent, Detective, Corrective, Compensating, Directive"
  },
  {
    "Name": "Preventive Control",
    "Description": "Prevents security incidents by stopping unwanted or unauthorized activity before it occurs. Examples include firewalls, locks, and access control lists."
  },
  {
    "Name": "Deterrent Control",
    "Description": "Discourages potential attackers or policy violations through visible warnings or consequences. Examples include security signs, guards, and surveillance cameras."
  },
  {
    "Name": "Detective Control",
    "Description": "Identifies and alerts when a security incident occurs or has occurred. Examples include intrusion detection systems (IDS), CCTV monitoring, and log reviews."
  },
  {
    "Name": "Corrective Control",
    "Description": "Responds to and fixes issues after they have been detected. Examples include restoring backups, patching vulnerabilities, and reimaging compromised systems."
  },
  {
    "Name": "Compensating Control",
    "Description": "Provides alternative protection when the primary control cannot be implemented. Examples include manual review processes or temporary technical safeguards."
  },
  {
    "Name": "Directive Control",
    "Description": "Guides or enforces expected behavior within the organization. Examples include security policies, acceptable use policies, and posted procedures."
  }
  {
    "Name": "CIA Triad",
    "Description": "Confidentiality – prevent unauthorized access (encryption, access control). Integrity – ensure accuracy (hashing, checksums). Availability – ensure access (redundancy, backups)."
  },
  {
    "Name": "Non-Repudiation and Integrity Proofs",
    "Description": "Non-repudiation prevents denial of actions (digital signatures, logs). Proof of Integrity verifies data unchanged (hashing). Proof of Origin confirms sender identity (authentication, signatures)."
  },
  {
    "Name": "AAA Framework",
    "Description": "Identification – claim identity (username). Authentication – verify identity (password, MFA). Authorization – define access. Accounting – logs user actions."
  },
  {
    "Name": "Authentication Flow",
    "Description": "User enters credentials. Firewall or VPN forwards to AAA server. Server validates credentials. Access granted if approved."
  },
  {
    "Name": "Certificate-Based Authentication",
    "Description": "Uses digital certificates issued by a Certificate Authority (CA). Verifies identity using public-key cryptography. Used in VPNs, Wi-Fi, secure email."
  },
  {
    "Name": "Authorization Models",
    "Description": "Define how access is granted. RBAC (Role-Based), ABAC (Attribute-Based), MAC/DAC. Abstraction groups permissions to simplify management."
  },
  {
    "Name": "Security Assessments",
    "Description": "Gap Analysis – compare current vs desired state. Baseline – define standard configuration. Reporting – identify weaknesses and improvements."
  },
  {
    "Name": "Zero Trust Architecture",
    "Description": "Principle: never trust, always verify. Includes data/control planes, adaptive identity, policy enforcement points, and threat scope reduction."
  },
  {
    "Name": "Physical Security Controls",
    "Description": "Barricades, fences, bollards, CCTV, guards, badges, and access vestibules restrict or monitor access."
  },
  {
    "Name": "Deception and Detection Tools",
    "Description": "Honeypots, honeynets, honeyfiles, and honeytokens attract attackers or detect misuse."
  },
  {
    "Name": "Change Management",
    "Description": "Structured process for managing IT changes. Includes ownership, stakeholders, impact analysis, sandbox testing, backout plan, and documentation."
  },
  {
    "Name": "Software and System Controls",
    "Description": "Allow list – approved applications only. Deny list – block malicious software. Maintain redundancy and isolate legacy systems."
  },
  {
    "Name": "Public Key Infrastructure (PKI)",
    "Description": "Framework for managing certificates and encryption keys. Supports symmetric/asymmetric encryption and key escrow."
  },
  {
    "Name": "Encryption Practices",
    "Description": "Data at rest – BitLocker, FileVault. Data in transit – TLS, VPN. Data in use – secure memory. Use AES/RSA/ECC with strong key management."
  },
  {
    "Name": "Cryptographic Hardware",
    "Description": "TPM, HSM, KMS, and Secure Enclave manage encryption keys securely and isolate sensitive operations."
  },
  {
    "Name": "Data Obfuscation and Privacy",
    "Description": "Obfuscation hides intent. Steganography hides data in media. Tokenization replaces sensitive data. Data masking hides parts of data."
  },
  {
    "Name": "Hashing and Digital Signatures",
    "Description": "Hashing verifies integrity. SHA-256 is secure. MD5/SHA-1 are obsolete. Digital signatures verify authenticity and non-repudiation."
  },
  {
    "Name": "Blockchain",
    "Description": "Immutable distributed ledger linking transactions with hashes. Used for secure tracking and verification."
  },
  {
    "Name": "Digital Certificates and Trust",
    "Description": "X.509 certificates bind keys to identities. Managed by Certificate Authorities (CAs). Includes CSRs, SANs, and wildcard certificates."
  },
  {
    "Name": "Certificate Revocation",
    "Description": "CRL lists revoked certs. OCSP checks validity in real time. OCSP stapling improves performance."
  }
]
