[
  {
    "Name": "Security Policy Guidelines",
    "Description": "Define high-level security expectations for the organization. Explain what must be protected and why."
  },
  {
    "Name": "Information Security Policies",
    "Description": "Master document containing all organizational security policies. Includes compliance and enforcement requirements. Procedures are documented separately."
  },
  {
    "Name": "Acceptable Use Policy (AUP)",
    "Description": "Defines how systems may be used, including networks, internet, messaging, and devices. Helps reduce liability and misuse."
  },
  {
    "Name": "Business Continuity",
    "Description": "Plans to maintain operations during disruptions. May include manual or alternate workflows. Must be documented and tested regularly."
  },
  {
    "Name": "Disaster Recovery Plan (DRP)",
    "Description": "Focuses on restoring IT systems after a disaster. Includes alternate site planning, backup/recovery, and staff availability considerations."
  },
  {
    "Name": "Security Incidents & Examples",
    "Description": "Include malware execution, phishing, ransomware, DDoS attacks, and unauthorized access or data theft."
  },
  {
    "Name": "Incident Response Roles",
    "Description": "Security management: oversight and authority. Compliance/legal: regulatory compliance. Technical staff: investigation and restoration. Users: report suspicious activity."
  },
  {
    "Name": "SDLC (Software Development Lifecycle)",
    "Description": "Framework for developing and maintaining software. Security integration (DevSecOps) ensures protection across waterfall, agile, or DevOps models."
  },
  {
    "Name": "Change Management",
    "Description": "Structured process for modifying configurations. Includes approval, scheduling, testing, and rollback plans to avoid system disruption."
  },
  {
    "Name": "Onboarding",
    "Description": "Create user accounts, assign permissions, issue equipment, and ensure policy acknowledgment."
  },
  {
    "Name": "Offboarding",
    "Description": "Disable accounts, revoke access, retrieve company assets, and document separation activities."
  },
  {
    "Name": "Playbooks",
    "Description": "Documented response steps for specific incidents such as phishing or malware infection."
  },
  {
    "Name": "SOAR (Security Orchestration, Automation, Response)",
    "Description": "Automates security responses and integrates tools for faster coordinated incident handling."
  },
  {
    "Name": "Governance",
    "Description": "Structures such as committees guide security strategy and enforce accountability."
  },
  {
    "Name": "Centralized vs Decentralized Governance",
    "Description": "Centralized: decisions made by one authority. Decentralized: distributed decision-making across groups or regions."
  },
  {
    "Name": "Laws, Regulations & Standards",
    "Description": "SOX ensures financial integrity; HIPAA protects health data. Legal teams handle evidence, breach notifications, and compliance."
  },
  {
    "Name": "Industry-Specific Requirements",
    "Description": "Utilities, medical, and financial industries may require enhanced regulatory compliance and control frameworks."
  },
  {
    "Name": "Geographic vs Global Security",
    "Description": "Regional laws differ globally, especially regarding data storage and privacy (e.g., GDPR)."
  },
  {
    "Name": "Data Roles & Responsibilities",
    "Description": "Owner defines and classifies data; Controller determines purpose; Processor handles data; Custodian maintains security and compliance."
  },
  {
    "Name": "Risk Assessments",
    "Description": "Ad hoc: when needed. Recurring: scheduled. Qualitative: judgment-based. Quantitative: uses numerical metrics (AV, EF, ARO)."
  },
  {
    "Name": "Quantitative Risk Metrics",
    "Description": "SLE = AV × EF. ALE = ARO × SLE. These measure financial impact of security risks."
  },
  {
    "Name": "Risk Concepts",
    "Description": "Impact: life, safety, finances. Likelihood: chance of occurrence. Risk appetite: acceptable risk level. Tolerance: deviation range."
  },
  {
    "Name": "Risk Register",
    "Description": "Tracks risk details including ownership, severity, mitigation, and monitoring indicators."
  },
  {
    "Name": "Risk Response Strategies",
    "Description": "Transfer (insurance), Accept, Avoid, or Mitigate. Exceptions may allow deviation from standard controls."
  },
  {
    "Name": "Business Recovery Metrics",
    "Description": "RTO: target restore time. RPO: acceptable data loss. MTTR: mean time to repair. MTBF: mean time between failures."
  },
  {
    "Name": "Vendor and Supply Chain Management",
    "Description": "Includes right-to-audit, internal/external audits, and due diligence before vendor approval."
  },
  {
    "Name": "Vendor Monitoring",
    "Description": "Ongoing evaluation of vendor performance, compliance, and security posture."
  },
  {
    "Name": "Vendor Questionnaires",
    "Description": "Used to assess vendor risk, compliance status, and contractual obligations."
  },
  {
    "Name": "Agreements & Contracts",
    "Description": "Include SLA, MOU, MOA, MSA, SOW, NDA, and BPA to define roles, expectations, and confidentiality."
  },
  {
    "Name": "Compliance & Privacy",
    "Description": "Ensures adherence to laws, policies, and regulations. Noncompliance may result in fines or penalties."
  },
  {
    "Name": "GLBA (Gramm-Leach-Bliley Act)",
    "Description": "Protects consumer financial data and enforces privacy safeguards for institutions."
  },
  {
    "Name": "GDPR (General Data Protection Regulation)",
    "Description": "EU privacy law granting individuals control over personal data collection and processing."
  },
  {
    "Name": "Data Subject",
    "Description": "The individual whose personal data is collected, stored, or processed."
  },
  {
    "Name": "Cybersecurity Audits & Attestation",
    "Description": "Audits evaluate control effectiveness; attestation confirms accuracy of results. Can be internal or external."
  },
  {
    "Name": "Reconnaissance",
    "Description": "Passive: collect public information. Active: direct interaction (e.g., scanning) to identify vulnerabilities."
  },
  {
    "Name": "Phishing Campaigns",
    "Description": "Used to train employees and measure awareness. Teaches users to recognize and report social engineering attempts."
  },
  {
    "Name": "Security Awareness Team",
    "Description": "Develops, maintains, and communicates training materials and awareness programs."
  },
  {
    "Name": "User Behavior & Awareness Training",
    "Description": "Covers password hygiene, social engineering, data handling, remote work safety, and insider threat awareness."
  }
]
