[
  {
    "Name": "Secure Baselines",
    "Description": "Define the expected secure state of a system. Used to detect unauthorized changes or configuration drift."
  },
  {
    "Name": "Establish Baselines",
    "Description": "Create and document configurations per OS, app, and device type. Follow vendor or industry standards such as CIS Benchmarks and Microsoft Security Baselines."
  },
  {
    "Name": "Deploy Baselines",
    "Description": "Use centralized deployment tools like Group Policy, MDM, or Configuration Manager. Different platforms may require unique methods."
  },
  {
    "Name": "Maintain Baselines",
    "Description": "Update baselines for new vulnerabilities, OS changes, or updated standards. Continuously test and verify compliance."
  },
  {
    "Name": "System Hardening",
    "Description": "Default configurations are rarely secure. Follow vendor or CIS guides to reduce attack surface."
  },
  {
    "Name": "Mobile Device Hardening",
    "Description": "Use MDM for enforcement, update OS/apps, and separate work/personal data with containers or profiles."
  },
  {
    "Name": "Workstation Hardening",
    "Description": "Apply updates, remove unnecessary software, and enforce policies via Group Policy or config management."
  },
  {
    "Name": "Network Device Hardening",
    "Description": "Change default credentials, restrict remote management, and apply firmware and security patches."
  },
  {
    "Name": "Cloud Infrastructure Hardening",
    "Description": "Use least privilege, secure management interfaces, implement EDR, and back up data to separate cloud storage."
  },
  {
    "Name": "Server Hardening",
    "Description": "Apply OS and app patches, restrict services, and enable monitoring/logging."
  },
  {
    "Name": "SCADA / ICS Security",
    "Description": "Industrial networks must be strictly segmented and isolated from corporate or internet networks."
  },
  {
    "Name": "Embedded Systems & IoT",
    "Description": "Often difficult to patch—use network segmentation, change default credentials, and isolate on VLANs."
  },
  {
    "Name": "RTOS (Real-Time Operating Systems)",
    "Description": "Used in automotive, medical, or infrastructure systems. Minimize running services and isolate communication paths."
  },
  {
    "Name": "Wireless Site Surveys",
    "Description": "Identify access points, signal strength, and interference. Create heat maps for optimal coverage and performance."
  },
  {
    "Name": "Wireless Survey Tools",
    "Description": "Use OS utilities, third-party analyzers, and spectrum analyzers for network visibility."
  },
  {
    "Name": "Mobile Device Management (MDM)",
    "Description": "Centralized configuration and enforcement for mobile devices. Controls apps, camera, encryption, and remote wipe."
  },
  {
    "Name": "BYOD (Bring Your Own Device)",
    "Description": "Employees use personal devices for work. Hard to enforce uniform security compliance."
  },
  {
    "Name": "COPE (Company-Owned, Personally Enabled)",
    "Description": "Corporate devices configured for both business and limited personal use. Balances user freedom with enterprise control."
  },
  {
    "Name": "Cellular Network Security",
    "Description": "Segment coverage into secure cells. Protect mobile data access using encryption and MDM."
  },
  {
    "Name": "Wi-Fi Security",
    "Description": "Encrypt wireless traffic and authenticate users before granting access."
  },
  {
    "Name": "Bluetooth Security",
    "Description": "Short-range communication. Avoid pairing with unknown devices to reduce risk."
  },
  {
    "Name": "WPA2-PSK Weakness",
    "Description": "Vulnerable to offline dictionary attacks on captured handshakes."
  },
  {
    "Name": "WPA3 Improvements",
    "Description": "Uses SAE (Simultaneous Authentication of Equals) for key exchange. Prevents brute-force attacks and adds forward secrecy."
  },
  {
    "Name": "GCMP (Galois/Counter Mode Protocol)",
    "Description": "Provides AES encryption and integrity protection for wireless traffic."
  },
  {
    "Name": "Wireless Authentication Modes",
    "Description": "WPA3-Personal (PSK) uses shared passphrase. WPA3-Enterprise (802.1X) authenticates users via RADIUS."
  },
  {
    "Name": "AAA Framework",
    "Description": "Authentication verifies identity, Authorization defines permissions, and Accounting logs user activity."
  },
  {
    "Name": "RADIUS",
    "Description": "Centralized authentication and policy enforcement service for network access."
  },
  {
    "Name": "802.1X + EAP",
    "Description": "Network Access Control requiring device authentication before network connectivity. Uses RADIUS or Kerberos."
  },
  {
    "Name": "Application Security – Input Validation",
    "Description": "Always validate and sanitize user input to prevent injection attacks."
  },
  {
    "Name": "Secure Cookies",
    "Description": "Use HTTPS-only cookies to protect session integrity and prevent hijacking."
  },
  {
    "Name": "SAST (Static Application Security Testing)",
    "Description": "Scan source code before deployment to detect vulnerabilities early."
  },
  {
    "Name": "Code Signing",
    "Description": "Digitally sign software with a private key to ensure code integrity and authenticity."
  },
  {
    "Name": "Sandboxing",
    "Description": "Run code in isolated environments to limit potential system compromise."
  },
  {
    "Name": "Application Security Monitoring",
    "Description": "Monitor logs, detect anomalies, and audit output to identify application-level threats."
  },
  {
    "Name": "Asset Management",
    "Description": "Track all assets with ownership and lifecycle details using centralized systems and asset tags."
  },
  {
    "Name": "Media Sanitization",
    "Description": "Securely remove data before disposal using wiping, degaussing, shredding, or destruction. Document with a Certificate of Destruction."
  },
  {
    "Name": "Data Retention",
    "Description": "Maintain backups and archives as required for compliance and business continuity."
  },
  {
    "Name": "Vulnerability Scanning",
    "Description": "Perform internal and external low-impact scans to identify weaknesses and configuration issues."
  },
  {
    "Name": "Dynamic Analysis / Fuzzing",
    "Description": "Send unexpected or malformed input to detect software crashes or logic flaws."
  },
  {
    "Name": "Package Monitoring",
    "Description": "Verify software package integrity and authenticity before installation or updates."
  },
  {
    "Name": "Threat Intelligence Sources",
    "Description": "Includes OSINT (open-source intelligence), commercial threat feeds, and shared information via organizations like CTA."
  },
  {
    "Name": "Penetration Testing",
    "Description": "Simulates real-world attacks to uncover weaknesses. Requires defined scope, methods, and rules of engagement."
  },
  {
    "Name": "Attack Phases in Pen Testing",
    "Description": "Stages include initial access, lateral movement, persistence, and pivoting between systems."
  },
  {
    "Name": "Vulnerability Prioritization",
    "Description": "Use CVSS scores (0–10) and CVE identifiers to rank and track vulnerabilities."
  },
  {
    "Name": "Risk Considerations",
    "Description": "Evaluate exposure factor, business impact, and risk tolerance to determine remediation urgency."
  },
  {
    "Name": "Mitigation & Remediation",
    "Description": "Apply patches, segment networks, and use compensating controls if patching is not possible. Verify fixes through scans."
  },
  {
    "Name": "Security Monitoring & SIEM",
    "Description": "SIEM tools collect and correlate logs across systems for detection, alerting, and reporting."
  },
  {
    "Name": "Alert Response",
    "Description": "Quarantine affected systems and tune alerts to reduce noise and false positives."
  },
  {
    "Name": "SCAP (Security Content Automation Protocol)",
    "Description": "Standardized compliance and configuration automation framework for security validation."
  },
  {
    "Name": "DLP (Data Loss Prevention)",
    "Description": "Prevents sensitive data from leaving via email, cloud, or endpoints through policy-based controls."
  },
  {
    "Name": "Logging & Event Analysis",
    "Description": "Review firewall, application, endpoint, OS, IDS/IPS, and network logs. Analyze metadata and packet captures for threat investigation."
  }
]
